Tekla Open API Reference for Tekla Structures 2025
LoadingForm.AllowClosing Property
 Allows the closing of the dialog. By default disabled.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AllowClosing { get; set; }
Public Property AllowClosing As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
LoadingForm Class
Tekla.Structures.Dialog.UIControls Namespace